/*
একটা রুমে 100 টা Candle আছে।সবগুলোই  off/নেভানো।আমাদের একটা কাজ আছে এখানে।
১.আমরা শুরুতে ১০০ এর ভিতর ১এর সকল গুণিতক ট্যাগ যুক্ত মোমবাতিকে জ্বালাবো। সবগুলোই জ্বলে উঠবে।
২.এরপর ২এর গুণিতক ট্যাগের মোমবাতিগুলোকে নিভায় দিবো। 
অর্থাৎ off থাকলে on করবো।আর on থাকলে off.
যেমন: 2এর গুণিতকের জন্য স্টেপে 2,4,6,8,10...সব জ্বলে উঠছে।
আবার 3এর গুণিতকের স্টেপে 
6কিন্তু নিভে যাবে।জ্বলে উঠবে না।

এভাবে 100পর্যন্ত স্টেপগুলো করতে হবে।
আউটপুট:  100 স্টেপ শেষে কতটা মোমবাতি জ্বলবে?
*/

#include <stdio.h>

void swap(int *n)
{
    if (*n == 1) {
        *n = 0;
    }
    else {
        *n = 1;
    }
}

int main()
{
    int size = 10001;
    int i, j, count = 0;
    int arr[size];

    for (i = 1; i < size; i++) {
        arr[i] = 1;
    }

    for (i = 2; i < size; i++) {
        for (j = i; j < size; j += i) {
            swap(&arr[j]);
        }
    }

    for (i = 1; i < size; i++) {
        if (arr[i] != 0) {
            count++;
        }
    }

    printf("%d", count);

    return 0;
}